app/Controllers/Home.php

    public function index()
    {
        $data = [
            "page_title" => "Electrogati: Buy, Sell and Rent used cars online",
            "page" => "home"
        ];
        $data['rent']=$this->rentModel->findall();
        $data['sale']=$this->saleModel->findall();
---
SELECT *
FROM `rent`
SELECT *
FROM `sales`