app/Controllers/Rentlisted.php

    public function index(){
        $data['rent']= NULL;
        $data = [
            "page_title" => "Mobility » Vehicles on Rent",
            "page" => "rent",
        ];

        $data['rents'] = $this->rentModel->findAll(6,0);
---
SELECT *
FROM `rent`
 LIMIT 6