app/Controllers/Salelisted.php

SELECT *
FROM `sales`
 LIMIT 6
---
    public function index(){
        $data['sales']= NULL;
        $data = [
            "page_title" => "Mobility » Vehicles on Sale",
            "page" => "sale",
        ];

        $data['sales'] = $this->salesModel->findAll(6,0);