app/Models/ProfileModel.php

    public function updateLogoutTime($id)
    {
        $builder = $this->db->table('login_activity');
        $builder->where('id', $id);
        $builder->update(['logout_time' => date('Y-m-d h:i:s')]);
---
UPDATE `login_activity` SET `logout_time` = '2022-07-15 12:09:01'
WHERE `id` = 64